#include <iostream>

using namespace std;

/*
<conditional_variable> - шаблон нужного типа с встроиным мутексом
wait
notify (notify one) - разблокирует 1 поток, который ожидает работу с мутексом
notify (notify all) - разблокирует все потоки, которые ожидают работу с мутексом
+ мутекс переменная

<atomic> 
volotule - роазрешение на неявное изменение переменной 
РОберт Джардейн персональные ЭВМ - ассемблер
атомик - шаблон. гарантируется, что будте считано корректное значение, а не мусор. андефайн бехевера не будет
переменные -    load - считывает
                store - записывает

с++11++
с++98/03 - закрыли 
с++11 - лямбда-выражения, потоки + мьютексы/треды/асинк/вьючерсы/промисы/кондитиотнал варианбы/атомик (параллельные вычисления)
    с++11 Страуструп
    с++11/14  Мейерс + Джосьюис 2е издание (Josuttis)
с++14
    концепты
с++17 - Галовиц + Джосьютис
с++20
с++23 - возможно будет поддерживаться

запланированно С++11:
    _cplusplus
    auto
    range_based for
    >>
    default/delete
    копирование/перемещение
    enum class
    константные выражения (constexpr)
    decltype
    std::initializer_list
    сужение типов
    Делегирующие конструкторы
    инициализация членов класса 
    унаследованные конструкторы 
    утвержджение времени компиляции (static_asert)
    long long
    nullptr
    суффиксный тип 
    шаблоны с переменный числом параметров (variatic template)
    унифицированный синтаксис и семантика инициализации 
    правосторонние ссылки
    сырые строки 
    пользовательские литералы
    атрибуты([[]])
    выравнивание
    overide
    final
    functional 
    chrono
    регулярные выражения


*/

int main() {


    return 0;
}